app/controllers/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
    @calendars = Calendar.all

INSERT INTO "calendars" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rhonda Huber"], ["title", "Rem id praesentium "], ["content", "Iusto ab et in quibu"], ["created_at", "2023-01-10 09:26:15.558625"], ["updated_at", "2023-01-10 09:26:15.558625"]]
---
  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save

DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 1]]
---
  def destroy
    @calendar.destroy

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_calendar
      @calendar = Calendar.find(params[:id])